{
"nodes": [
    {"data": {"id": "bc", "title":"200 BC",
    "content1":"Tribes and villages grow and organize. Evidence points to a Tormek base in the Northern Mountains as the largest settlement at the time.",
    "content2":"BC stands for Before Crius. This means before the name for the planet was unified across all countries. During this time each country addressed time in different ways."},
    "position": {"x": 130, "y": 240}},
    {"data": {"id": "vc", "title":"VC",
    "content1":"\"Vivat Crius\" or \"Long Live Crius!\" Year Zero: Crius is established as the name used in all countries to refer to the wonderful world they inhabit.",
    "content2":"Records were not well documented for time before 1 BC."},
    "position": {"x": 170, "y": 235}},
    {"data": {"id": "vc2", "title":"100 VC",
    "content1":"Oogley Meeps and Sherwin begin their journey to map out and research all of Veargreum. It also marks the emergence of the country.",
    "content2":"?https://www.catchycantrips.com/categorization/sherwin-journals?The fruits of their research were compiled in the Sherwin Journals."},
    "position": {"x": 190, "y": 230}},
    {"data": {"id": "vc3", "title":"220 VC",
    "content1":"The 3 founding families come together: Meadows, Wallsons and Littlefoots.","content2":""},
    "position": {"x": 215, "y": 230}},
    {"data": {"id": "vc4", "title":"584 VC Shaping up",
    "content1":"The founding families take a representative from the newly formed regions to form the \"House of 9\".","content2":""},
    "position": {"x": 300, "y": 225}},
    {"data": {"id": "vc5", "title":"895 VC Disaster",
    "content1":"The once prosperous Tardrix loses its Sun, blocked away behind a blanket of ash. The complete indifference of the rest of Veargreum to their frozen sterile farms, and the penetrating, bone-snapping chill they had to endure in the everlasting night; prompt their withdrawal from the House of 9.","content2":""},
    "position": {"x": 360, "y": 235}},
    {"data": {"id": "vc6", "title":"1095 VC Blind Lady",
    "content1":"A new leader for The House of 9 is placed in power: Miri, a mechanical woman built specifically for the task.","content2":""},
    "position": {"x": 380, "y": 230}},
    {"data": {"id": "vc7", "title":"1392 VC Great Calamity",
    "content1":"When the heavens fell and destroyed the Hollow Point island (and everyone on it).","content2":""},
    "position": {"x": 440, "y": 240}},
    {"data": {"id": "vc8", "title":"1395 VC Affliction",
    "content1":"Current Year: Tensions are high with incesant reports of a strange disease (unstoppable so far) corrupting everything it comes into contact with.",
    "content2":"?https://www.catchycantrips.com/lore/affliction?[REDACTED - COGNITO HAZARD]"},
    "position": {"x": 445, "y": 245}},

    {"data": {"id":"lo01", "title":"Tardrix - Former House","label":"Tardrix",
    "content1":"Once a land teeming with abundance, now lies beneath a frigid veil of glaciers and frozen lakes. A dramatic shift in fortune was wrought by the volcanic tumult erupting from a nerby island, veiling the sky in perpetual shadow and plunging temperatures with an icy grip.",
    "content2":"In the wake of this cataclysmic transformation, the hardy inhabitants of Tardrix adopted a nomadic existence, tracing the migratory routes of colossal herbivores. These gentle giants provide not only sustenance but also the vital materials for crafting warm clothing, a lifeline in the unrelenting cold."},
    "position":{"x": 65,"y": 40},"classes":["locationnode"]},
    {"data": {"id":"lo02", "title":"Camenisa's Cauldron","label":"Camenisa's Cauldron",
    "content1":"Once believed to just be a mountain range on the island of Jewelhold, ended up erupting due to excessive mining. Now an active volcanic range, the city of Caldera was constructed inside one of the volcanos. The city's buildings are constructed like pyramids, crafted from cooled igneous rocks and obsidian, gathering just enough strength to withstand the volcano's ground shaking roar.",
    "content2":"Although the main peak is where the city resides, Camenisa's Cauldron has several peaks, including one that produces a strange blue magma that is cool to the touch."},
    "position":{"x": 140,"y": 55},"classes":["locationnode"]},
    {"data": {"id":"lo03", "title":"Sea of Glass","label":"Sea of Glass",
    "content1":"A sprawling desert realm situated to the south of an intensely active volcanic expanse. In an era preceding the awakening of the fiery mountains, this desert was like any other. Yet, the cataclysmic eruption transformed its destiny, ushering in an enduring nightfall obscured by ash and smoke. Over the passage of countless centuries, the relentless volcanic unrest usher in never ending storms to dance across the skies, their lightning transforming the sandy dunes into dark fulgurite glass.",
    "content2":""},"position":{"x": 110,"y": 70},"classes":["locationnode"]},
    {"data": {"id":"lo10", "title":"Escaria - Radiant Reef","label":"Radiant Reef",
    "content1":"Deep beneath the waves of the Aestarian Sea, hidden from the prying eyes of the world above, lies a city unlike any other. Escaria, a bioluminescent metropolis, carved into colossal spires of coral that have grown out from the sea floor.",
    "content2":""},"position":{"x": 145,"y": 95},"classes":["locationnode"]},
    {"data": {"id":"lo20", "title":"Dawning Dunes","label":"Dawning Dunes",
    "content1":"A desert of awe-inspiring expanse and unparalleled harshness. Scant vegetation breaks the desolate landscape of shifting sands and innumerable mirages, each more disappointing than the next under the scorhing Sun.",
    "content2":"WARNING! Life here has been hardened by formidable environmental challenges. Do you fashion yourself stronger than the world!"},"position":{"x": 215, "y": 28},"classes":["locationnode"]},
    {"data": {"id":"lo21", "title":"Auraveil","label":"Auraveil",
    "content1":"Auraviel is a vibrant coastal town renowned for its artistic prowess. Each year, the town celebrates Carmens Call with a grand festival, culminating in a dazzling light display to honor Camenisa, the goddess of the arts. This enchanting event showcases Auraviel's dedication to creativity and beauty.",
    "content2":""},"position":{"x": 200,"y": 80},"classes":["locationnode"]},
    {"data": {"id":"lo11", "title":"Unchained Isles","label":"Unchained Isles",
    "content1":"Fabled across the maritime realm, these islands are renowned for their inclination to wander with the seasonal ocean currents. Their very landscape is a symphony of vibrant life—crafted from the artistry of living coral and nestled amid the embrace of soft, sponge-like sediments that firmly anchor the coral structures in place.",
    "content2":""},"position":{"x": 335,"y":37},"classes":["locationnode"]},
    {"data": {"id":"lo12", "title":"Tamatoe Tree","label":"Tamatoe Tree",
    "content1":"Region: Veliko",
    "content2":"The Tamatoe Tree, a colossal arboreal wonder that soars to skyscraper heights, is shrouded in mystique as both the clandestine headquarters of the enigmatic SOC organization and the tangible conduit to Tomatoe the happy, deity of the feys. It serves as an unparalleled nexus where fey from far and wide converge, drawn by its divine connection and the promise of vibrant fey magic unfurling in its verdant embrace. In the shadow of this magnificent arboreal titan, secrets and enchantments intertwine, creating an extraordinary haven where the mundane and the mystical seamlessly merge."},"position":{"x":400,"y":75},"classes":["locationnode","center-right"]},
    {"data": {"id":"lo13", "title":"Therandra - Veliko","label":"Therandra",
    "content1":"The formidable stronghold of the Saymora, an insectoid race, stands as a testament to their remarkable ingenuity and relentless progress. Meticulously designed to cater to the diverse forms of insectoid lifeforms that call it home, Therandra boasts a breathtaking skyline, with towering spires connected by a complex network of interwoven cables that resemble intricate spider webs. Beneath the surface, a labyrinthine system of underground tunnels provides further functionality, while at ground level, more conventional buildings seamlessly blend into this awe-inspiring architectural marvel. The very name Therandra resonates with the industrious spirit and adaptability of the Saymora, underscoring their ability to create a thriving and efficient city that transcends the boundaries of form and function.",
    "content2":""},"position":{"x": 394,"y":88},"classes":["locationnode","center-right"]},
    {"data": {"id":"lo30", "title":"Tormek Mountains","label":"Tormek Mountains",
    "content1":"Within these mountains, the resilient Tormek dwarves make their homes, primarily residing in the interior regions. The rhythmic echoes of their forging hammers reverberate through the peaks, a testament to their industrious civilization. The Dwarves have established roads and outposts, facilitating travel and trade amidst the harsh terrain.",
    "content2":""},"position":{"x": 230,"y":65},"classes":["locationnode"]},
    {"data": {"id":"lo31", "title":"Valley of the Four Seasons","label":"Valley",
    "content1":"Nestled between the Tormek mountains and the Severed Wilds jungle lies the mysterious valley.",
    "content2":"This mystical realm came into being centuries ago when the denizens of Ayenwood, seeking seclusion from the material plane, harnessed the power of the Twilite Drift. Their druids, drawing upon its energies, endeavored to transport their town to that otherworldly plane, but instead, they brought the essence of the Twilite Drift into the material world, shaping the entire valley."},"position":{"x": 215,"y":80},"classes":["locationnode","center-right"]},
    {"data": {"id":"lo32", "title":"Stillvein","label":"Stillvein",
    "content1":"Nestled at the foot of the towering Tormek Mountains, Stillvein thrives as a bustling mining settlement. The grand iron gates that guard the entrance to the mines stand as a testament to the town's industrious spirit, providing a secure portal into the subterranean depths. Beyond these imposing doors, the settlement sprawls open amidst the undulating hills, embracing both fertile farmlands and the reassuring presence of a fortified refuge, ensuring both sustenance and safety in times of crisis.",
    "content2":""},"position":{"x":255,"y":80},"classes":["locationnode","center-right"]},
    {"data": {"id":"lo33", "title":"Maven","label":"Maven",
    "content1":" Perched amidst the lofty heights of the Tormek Mountains, Maven is a marvel of architecture, seamlessly integrated into the mountainside. Buildings and intricate walkways are masterfully carved from the very stone of the mountain, creating a harmonious blend of nature and craftsmanship. This town's heart resides within the mountain's embrace, with resplendent halls and ceilings adorned with luminous gems, evoking the ethereal sensation of walking within a magnificent geode.",
    "content2":". Notably, Maven serves as the regal abode of the esteemed Tormek royal family, and as such, it stands as a bastion of security and fortification. Guarded with unwavering dedication, this breathtaking haven of both artistry and royalty is a testament to the melding of natural beauty and the heights of civilization."},
    "position":{"x": 300,"y":60},"classes":["locationnode"]},
    {"data": {"id":"lo34", "title":"Carat Cave","label":"Carat Cave",
    "content1":"A sprawling labyrinth of underground passages, house a treasure trove of crystals both colossal and exquisite. Its entrance to the embrace of the sea, beckoning the pirates to sail their vessel into its depths. Yet, treacherous waters and perilous whirlpools deter all but the boldest mariners.",
    "content2":""},"position":{"x":317,"y":75},"classes":["locationnode"]}
],
"edges": [
    {"data": {"id" : "lo0s1", "source":"lo01", "target": "lo02"}, "classes":["closedloop"]},
    {"data": {"id" : "lo0s2", "source":"lo02", "target": "lo03"}, "classes":["closedloop"]},
    {"data": {"id" : "lo0s3", "source":"lo03", "target": "lo01"}, "classes":["closedloop"]},
    {"data": {"id" : "lo1s0", "source":"vc5", "target": "lo01"}, "classes":["closedloop", "arrowedge"]},

    {"data": {"id" : "lo2s1", "source":"lo20", "target": "lo21"}, "classes":["closedloop"]},

    {"data": {"id" : "lo3s1", "source":"lo30", "target": "lo33"}, "classes":["closedloop"]},
    {"data": {"id" : "lo3s2", "source":"lo33", "target": "lo34"}, "classes":["closedloop"]},
    {"data": {"id" : "lo3s3", "source":"lo34", "target": "lo32"}, "classes":["closedloop"]},
    {"data": {"id" : "lo3s4", "source":"lo32", "target": "lo31"}, "classes":["closedloop"]},
    {"data": {"id" : "lo3s5", "source":"lo31", "target": "lo30"}, "classes":["closedloop"]},

    {"data": {"id" : "vcbc", "source": "vc", "target": "bc"}, "classes": ["arrowedge"]},
    {"data": {"id" : "vcvc2", "source": "vc", "target": "vc2"}, "classes": ["arrowedge"]},
    {"data": {"id" : "vcvc3", "source": "vc2", "target": "vc3"}},
    {"data": {"id" : "vcvc4", "source": "vc3", "target": "vc4"}},
    {"data": {"id" : "vcvc5", "source": "vc4", "target": "vc5"}},
    {"data": {"id" : "vcvc6", "source": "vc5", "target": "vc6"}},
    {"data": {"id" : "vcvc7", "source": "vc6", "target": "vc7"}},
    {"data": {"id" : "vcvc8", "source": "vc7", "target": "vc8"}}
]
}